# RefreshData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableSectionData..::..RefreshData Method
TableSectionData Class See Also
---
Rebuilds the data in this section if it is out of date.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool RefreshData()
```

Visual Basic
---
```text
Public Function RefreshData As Boolean
```

Visual C++
---
```text
public:
bool RefreshData()
```

# ### Return Value
True if the data is up to date after the refresh.
# See Also
TableSectionData Class
Autodesk.Revit.DB Namespace